Terraform Plan:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.gh_actions_assume_role_policy will be created
  + resource "aws_iam_policy" "gh_actions_assume_role_policy" {
      + arn         = (known after apply)
      + description = "Policy for GH Actions Assume Role"
      + id          = (known after apply)
      + name        = "gh-policy-dev-01"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.gh_actions_assume_role will be created
  + resource "aws_iam_role" "gh_actions_assume_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gh-actions-dev-role-01"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/iac_dev_infra_iam.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/iac_dev_infra_iam.tfplan"
stdout<<ghadelimiter_556587b9-1b99-41b3-a2b9-fa8d0134c30e

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.gh_actions_assume_role_policy will be created
  + resource "aws_iam_policy" "gh_actions_assume_role_policy" {
      + arn         = (known after apply)
      + description = "Policy for GH Actions Assume Role"
      + id          = (known after apply)
      + name        = "gh-policy-dev-01"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.gh_actions_assume_role will be created
  + resource "aws_iam_role" "gh_actions_assume_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gh-actions-dev-role-01"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/iac_dev_infra_iam.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/iac_dev_infra_iam.tfplan"

ghadelimiter_556587b9-1b99-41b3-a2b9-fa8d0134c30e
stderr<<ghadelimiter_808bd45d-ed71-464b-b324-35fa6a1240c0

ghadelimiter_808bd45d-ed71-464b-b324-35fa6a1240c0
exitcode<<ghadelimiter_eb6b1416-37ca-4a8e-b0df-fa9eb46f6b83
0
ghadelimiter_eb6b1416-37ca-4a8e-b0df-fa9eb46f6b83
```